---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetLegacyCurtainSubElements(Autodesk.Revit.DB.Element)
source: html/898e687e-5b3a-d2ff-3118-79cf964af1c8.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetLegacyCurtainSubElements Method

Gets the sub elements from a legacy curtain element.

## Syntax (C#)
```csharp
public static ICollection<ElementId> GetLegacyCurtainSubElements(
	Element element
)
```

## Parameters
- **element** (`Autodesk.Revit.DB.Element`) - The legacy curtain element.

## Returns
The element array.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null